GopalSaraf/Practicals/PSDL/include/proc/pic18f26q43.inc
// Register: CLCnGLS1
#define CLCnGLS1 CLCnGLS1
CLCnGLS1                                 equ 00DDh
// bitfield definitions
CLCnGLS1_G2D1N_POSN                      equ 0000h
CLCnGLS1_G2D1N_POSITION                  equ 0000h
CLCnGLS1_G2D1N_SIZE                      equ 0001h
CLCnGLS1_G2D1N_LENGTH                    equ 0001h
CLCnGLS1_G2D1N_MASK                      equ 0001h
CLCnGLS1_G2D1T_POSN                      equ 0001h
CLCnGLS1_G2D1T_POSITION                  equ 0001h
CLCnGLS1_G2D1T_SIZE                      equ 0001h
CLCnGLS1_G2D1T_LENGTH                    equ 0001h
CLCnGLS1_G2D1T_MASK                      equ 0002h
CLCnGLS1_G2D2N_POSN                      equ 0002h
CLCnGLS1_G2D2N_POSITION                  equ 0002h
CLCnGLS1_G2D2N_SIZE                      equ 0001h
CLCnGLS1_G2D2N_LENGTH                    equ 0001h
CLCnGLS1_G2D2N_MASK                      equ 0004h
CLCnGLS1_G2D2T_POSN                      equ 0003h
CLCnGLS1_G2D2T_POSITION                  equ 0003h
CLCnGLS1_G2D2T_SIZE                      equ 0001h
CLCnGLS1_G2D2T_LENGTH                    equ 0001h
CLCnGLS1_G2D2T_MASK                      equ 0008h
CLCnGLS1_G2D3N_POSN                      equ 0004h
CLCnGLS1_G2D3N_POSITION                  equ 0004h
CLCnGLS1_G2D3N_SIZE                      equ 0001h
CLCnGLS1_G2D3N_LENGTH                    equ 0001h
CLCnGLS1_G2D3N_MASK                      equ 0010h
CLCnGLS1_G2D3T_POSN                      equ 0005h
CLCnGLS1_G2D3T_POSITION                  equ 0005h
CLCnGLS1_G2D3T_SIZE                      equ 0001h
CLCnGLS1_G2D3T_LENGTH                    equ 0001h
CLCnGLS1_G2D3T_MASK                      equ 0020h
CLCnGLS1_G2D4N_POSN                      equ 0006h
CLCnGLS1_G2D4N_POSITION                  equ 0006h
CLCnGLS1_G2D4N_SIZE                      equ 0001h
CLCnGLS1_G2D4N_LENGTH                    equ 0001h
CLCnGLS1_G2D4N_MASK                      equ 0040h
CLCnGLS1_G2D4T_POSN                      equ 0007h
CLCnGLS1_G2D4T_POSITION                  equ 0007h
CLCnGLS1_G2D4T_SIZE                      equ 0001h
CLCnGLS1_G2D4T_LENGTH                    equ 0001h
CLCnGLS1_G2D4T_MASK                      equ 0080h

// Register: CLCnGLS2
#define CLCnGLS2 CLCnGLS2
CLCnGLS2                                 equ 00DEh
// bitfield definitions
CLCnGLS2_G3D1N_POSN                      equ 0000h
CLCnGLS2_G3D1N_POSITION                  equ 0000h
CLCnGLS2_G3D1N_SIZE                      equ 0001h
CLCnGLS2_G3D1N_LENGTH                    equ 0001h
CLCnGLS2_G3D1N_MASK                      equ 0001h
CLCnGLS2_G3D1T_POSN                      equ 0001h
CLCnGLS2_G3D1T_POSITION                  equ 0001h
CLCnGLS2_G3D1T_SIZE                      equ 0001h
CLCnGLS2_G3D1T_LENGTH                    equ 0001h
CLCnGLS2_G3D1T_MASK                      equ 0002h
CLCnGLS2_G3D2N_POSN                      equ 0002h
CLCnGLS2_G3D2N_POSITION                  equ 0002h
CLCnGLS2_G3D2N_SIZE                      equ 0001h
CLCnGLS2_G3D2N_LENGTH                    equ 0001h
CLCnGLS2_G3D2N_MASK                      equ 0004h
CLCnGLS2_G3D2T_POSN                      equ 0003h
CLCnGLS2_G3D2T_POSITION                  equ 0003h
CLCnGLS2_G3D2T_SIZE                      equ 0001h
CLCnGLS2_G3D2T_LENGTH                    equ 0001h
CLCnGLS2_G3D2T_MASK                      equ 0008h
CLCnGLS2_G3D3N_POSN                      equ 0004h
CLCnGLS2_G3D3N_POSITION                  equ 0004h
CLCnGLS2_G3D3N_SIZE                      equ 0001h
CLCnGLS2_G3D3N_LENGTH                    equ 0001h
CLCnGLS2_G3D3N_MASK                      equ 0010h
CLCnGLS2_G3D3T_POSN                      equ 0005h
CLCnGLS2_G3D3T_POSITION                  equ 0005h
CLCnGLS2_G3D3T_SIZE                      equ 0001h
CLCnGLS2_G3D3T_LENGTH                    equ 0001h
CLCnGLS2_G3D3T_MASK                      equ 0020h
CLCnGLS2_G3D4N_POSN                      equ 0006h
CLCnGLS2_G3D4N_POSITION                  equ 0006h
CLCnGLS2_G3D4N_SIZE                      equ 0001h
CLCnGLS2_G3D4N_LENGTH                    equ 0001h
CLCnGLS2_G3D4N_MASK                      equ 0040h
CLCnGLS2_G3D4T_POSN                      equ 0007h
CLCnGLS2_G3D4T_POSITION                  equ 0007h
CLCnGLS2_G3D4T_SIZE                      equ 0001h
CLCnGLS2_G3D4T_LENGTH                    equ 0001h
CLCnGLS2_G3D4T_MASK                      equ 0080h

// Register: CLCnGLS3
#define CLCnGLS3 CLCnGLS3
CLCnGLS3                                 equ 00DFh
// bitfield definitions
CLCnGLS3_G4D1N_POSN                      equ 0000h
CLCnGLS3_G4D1N_POSITION                  equ 0000h
CLCnGLS3_G4D1N_SIZE                      equ 0001h
CLCnGLS3_G4D1N_LENGTH                    equ 0001h
CLCnGLS3_G4D1N_MASK                      equ 0001h
CLCnGLS3_G4D1T_POSN                      equ 0001h
CLCnGLS3_G4D1T_POSITION                  equ 0001h
CLCnGLS3_G4D1T_SIZE                      equ 0001h
CLCnGLS3_G4D1T_LENGTH                    equ 0001h
CLCnGLS3_G4D1T_MASK                      equ 0002h
CLCnGLS3_G4D2N_POSN                      equ 0002h
CLCnGLS3_G4D2N_POSITION                  equ 0002h
CLCnGLS3_G4D2N_SIZE                      equ 0001h
CLCnGLS3_G4D2N_LENGTH                    equ 0001h
CLCnGLS3_G4D2N_MASK                      equ 0004h
CLCnGLS3_G4D2T_POSN                      equ 0003h
CLCnGLS3_G4D2T_POSITION                  equ 0003h
CLCnGLS3_G4D2T_SIZE                      equ 0001h
CLCnGLS3_G4D2T_LENGTH                    equ 0001h
CLCnGLS3_G4D2T_MASK                      equ 0008h
CLCnGLS3_G4D3N_POSN                      equ 0004h
CLCnGLS3_G4D3N_POSITION                  equ 0004h
CLCnGLS3_G4D3N_SIZE                      equ 0001h
CLCnGLS3_G4D3N_LENGTH                    equ 0001h
CLCnGLS3_G4D3N_MASK                      equ 0010h
CLCnGLS3_G4D3T_POSN                      equ 0005h
CLCnGLS3_G4D3T_POSITION                  equ 0005h
CLCnGLS3_G4D3T_SIZE                      equ 0001h
CLCnGLS3_G4D3T_LENGTH                    equ 0001h
CLCnGLS3_G4D3T_MASK                      equ 0020h
CLCnGLS3_G4D4N_POSN                      equ 0006h
CLCnGLS3_G4D4N_POSITION                  equ 0006h
CLCnGLS3_G4D4N_SIZE                      equ 0001h
CLCnGLS3_G4D4N_LENGTH                    equ 0001h
CLCnGLS3_G4D4N_MASK                      equ 0040h
CLCnGLS3_G4D4T_POSN                      equ 0007h
CLCnGLS3_G4D4T_POSITION                  equ 0007h
CLCnGLS3_G4D4T_SIZE                      equ 0001h
CLCnGLS3_G4D4T_LENGTH                    equ 0001h
CLCnGLS3_G4D4T_MASK                      equ 0080h

