GopalSaraf/Practicals/PSDL/include/proc/pic18f26q43.inc
// Register: U5P3L
#define U5P3L U5P3L
U5P3L                                    equ 02F5h
// bitfield definitions
U5P3L_P3L_POSN                           equ 0000h
U5P3L_P3L_POSITION                       equ 0000h
U5P3L_P3L_SIZE                           equ 0008h
U5P3L_P3L_LENGTH                         equ 0008h
U5P3L_P3L_MASK                           equ 00FFh

// Register: U5CON0
#define U5CON0 U5CON0
U5CON0                                   equ 02F7h
// bitfield definitions
U5CON0_MODE0_POSN                        equ 0000h
U5CON0_MODE0_POSITION                    equ 0000h
U5CON0_MODE0_SIZE                        equ 0001h
U5CON0_MODE0_LENGTH                      equ 0001h
U5CON0_MODE0_MASK                        equ 0001h
U5CON0_MODE1_POSN                        equ 0001h
U5CON0_MODE1_POSITION                    equ 0001h
U5CON0_MODE1_SIZE                        equ 0001h
U5CON0_MODE1_LENGTH                      equ 0001h
U5CON0_MODE1_MASK                        equ 0002h
U5CON0_MODE2_POSN                        equ 0002h
U5CON0_MODE2_POSITION                    equ 0002h
U5CON0_MODE2_SIZE                        equ 0001h
U5CON0_MODE2_LENGTH                      equ 0001h
U5CON0_MODE2_MASK                        equ 0004h
U5CON0_U5MODE_POSN                       equ 0000h
U5CON0_U5MODE_POSITION                   equ 0000h
U5CON0_U5MODE_SIZE                       equ 0004h
U5CON0_U5MODE_LENGTH                     equ 0004h
U5CON0_U5MODE_MASK                       equ 000Fh
U5CON0_U5RXEN_POSN                       equ 0004h
U5CON0_U5RXEN_POSITION                   equ 0004h
U5CON0_U5RXEN_SIZE                       equ 0001h
U5CON0_U5RXEN_LENGTH                     equ 0001h
U5CON0_U5RXEN_MASK                       equ 0010h
U5CON0_U5TXEN_POSN                       equ 0005h
U5CON0_U5TXEN_POSITION                   equ 0005h
U5CON0_U5TXEN_SIZE                       equ 0001h
U5CON0_U5TXEN_LENGTH                     equ 0001h
U5CON0_U5TXEN_MASK                       equ 0020h
U5CON0_U5ABDEN_POSN                      equ 0006h
U5CON0_U5ABDEN_POSITION                  equ 0006h
U5CON0_U5ABDEN_SIZE                      equ 0001h
U5CON0_U5ABDEN_LENGTH                    equ 0001h
U5CON0_U5ABDEN_MASK                      equ 0040h
U5CON0_U5BRGS_POSN                       equ 0007h
U5CON0_U5BRGS_POSITION                   equ 0007h
U5CON0_U5BRGS_SIZE                       equ 0001h
U5CON0_U5BRGS_LENGTH                     equ 0001h
U5CON0_U5BRGS_MASK                       equ 0080h
U5CON0_U5MODE0_POSN                      equ 0000h
U5CON0_U5MODE0_POSITION                  equ 0000h
U5CON0_U5MODE0_SIZE                      equ 0001h
U5CON0_U5MODE0_LENGTH                    equ 0001h
U5CON0_U5MODE0_MASK                      equ 0001h
U5CON0_U5MODE1_POSN                      equ 0001h
U5CON0_U5MODE1_POSITION                  equ 0001h
U5CON0_U5MODE1_SIZE                      equ 0001h
U5CON0_U5MODE1_LENGTH                    equ 0001h
U5CON0_U5MODE1_MASK                      equ 0002h
U5CON0_U5MODE2_POSN                      equ 0002h
U5CON0_U5MODE2_POSITION                  equ 0002h
U5CON0_U5MODE2_SIZE                      equ 0001h
U5CON0_U5MODE2_LENGTH                    equ 0001h
U5CON0_U5MODE2_MASK                      equ 0004h
U5CON0_MODE_POSN                         equ 0000h
U5CON0_MODE_POSITION                     equ 0000h
U5CON0_MODE_SIZE                         equ 0004h
U5CON0_MODE_LENGTH                       equ 0004h
U5CON0_MODE_MASK                         equ 000Fh
U5CON0_RXEN_POSN                         equ 0004h
U5CON0_RXEN_POSITION                     equ 0004h
U5CON0_RXEN_SIZE                         equ 0001h
U5CON0_RXEN_LENGTH                       equ 0001h
U5CON0_RXEN_MASK                         equ 0010h
U5CON0_TXEN_POSN                         equ 0005h
U5CON0_TXEN_POSITION                     equ 0005h
U5CON0_TXEN_SIZE                         equ 0001h
U5CON0_TXEN_LENGTH                       equ 0001h
U5CON0_TXEN_MASK                         equ 0020h
U5CON0_ABDEN_POSN                        equ 0006h
U5CON0_ABDEN_POSITION                    equ 0006h
U5CON0_ABDEN_SIZE                        equ 0001h
U5CON0_ABDEN_LENGTH                      equ 0001h
U5CON0_ABDEN_MASK                        equ 0040h
U5CON0_BRGS_POSN                         equ 0007h
U5CON0_BRGS_POSITION                     equ 0007h
U5CON0_BRGS_SIZE                         equ 0001h
U5CON0_BRGS_LENGTH                       equ 0001h
U5CON0_BRGS_MASK                         equ 0080h

// Register: U5CON1
#define U5CON1 U5CON1
U5CON1                                   equ 02F8h
// bitfield definitions
U5CON1_SENDB_POSN                        equ 0000h
U5CON1_SENDB_POSITION                    equ 0000h
U5CON1_SENDB_SIZE                        equ 0001h
U5CON1_SENDB_LENGTH                      equ 0001h
U5CON1_SENDB_MASK                        equ 0001h
U5CON1_BRKOVR_POSN                       equ 0001h
U5CON1_BRKOVR_POSITION                   equ 0001h
U5CON1_BRKOVR_SIZE                       equ 0001h
U5CON1_BRKOVR_LENGTH                     equ 0001h
U5CON1_BRKOVR_MASK                       equ 0002h
U5CON1_RXBIMD_POSN                       equ 0003h
U5CON1_RXBIMD_POSITION                   equ 0003h
U5CON1_RXBIMD_SIZE                       equ 0001h
U5CON1_RXBIMD_LENGTH                     equ 0001h
U5CON1_RXBIMD_MASK                       equ 0008h
U5CON1_WUE_POSN                          equ 0004h
U5CON1_WUE_POSITION                      equ 0004h
U5CON1_WUE_SIZE                          equ 0001h
U5CON1_WUE_LENGTH                        equ 0001h
U5CON1_WUE_MASK                          equ 0010h
U5CON1_ON_POSN                           equ 0007h
U5CON1_ON_POSITION                       equ 0007h
U5CON1_ON_SIZE                           equ 0001h
U5CON1_ON_LENGTH                         equ 0001h
U5CON1_ON_MASK                           equ 0080h
U5CON1_U5SENDB_POSN                      equ 0000h
U5CON1_U5SENDB_POSITION                  equ 0000h
U5CON1_U5SENDB_SIZE                      equ 0001h
U5CON1_U5SENDB_LENGTH                    equ 0001h
U5CON1_U5SENDB_MASK                      equ 0001h
U5CON1_U5BRKOVR_POSN                     equ 0001h
U5CON1_U5BRKOVR_POSITION                 equ 0001h
U5CON1_U5BRKOVR_SIZE                     equ 0001h
U5CON1_U5BRKOVR_LENGTH                   equ 0001h
U5CON1_U5BRKOVR_MASK                     equ 0002h
U5CON1_U5RXBIMD_POSN                     equ 0003h
U5CON1_U5RXBIMD_POSITION                 equ 0003h
U5CON1_U5RXBIMD_SIZE                     equ 0001h
U5CON1_U5RXBIMD_LENGTH                   equ 0001h
U5CON1_U5RXBIMD_MASK                     equ 0008h
U5CON1_U5WUE_POSN                        equ 0004h
U5CON1_U5WUE_POSITION                    equ 0004h
U5CON1_U5WUE_SIZE                        equ 0001h
U5CON1_U5WUE_LENGTH                      equ 0001h
U5CON1_U5WUE_MASK                        equ 0010h
U5CON1_U5ON_POSN                         equ 0007h
U5CON1_U5ON_POSITION                     equ 0007h
U5CON1_U5ON_SIZE                         equ 0001h
U5CON1_U5ON_LENGTH                       equ 0001h
U5CON1_U5ON_MASK                         equ 0080h

// Register: U5CON2
#define U5CON2 U5CON2
U5CON2                                   equ 02F9h
// bitfield definitions
U5CON2_FLO_POSN                          equ 0000h
U5CON2_FLO_POSITION                      equ 0000h
U5CON2_FLO_SIZE                          equ 0002h
U5CON2_FLO_LENGTH                        equ 0002h
U5CON2_FLO_MASK                          equ 0003h
U5CON2_TXPOL_POSN                        equ 0002h
U5CON2_TXPOL_POSITION                    equ 0002h
U5CON2_TXPOL_SIZE                        equ 0001h
U5CON2_TXPOL_LENGTH                      equ 0001h
U5CON2_TXPOL_MASK                        equ 0004h
U5CON2_STP_POSN                          equ 0004h
U5CON2_STP_POSITION                      equ 0004h
U5CON2_STP_SIZE                          equ 0002h
U5CON2_STP_LENGTH                        equ 0002h
U5CON2_STP_MASK                          equ 0030h
U5CON2_RXPOL_POSN                        equ 0006h
U5CON2_RXPOL_POSITION                    equ 0006h
U5CON2_RXPOL_SIZE                        equ 0001h
U5CON2_RXPOL_LENGTH                      equ 0001h
U5CON2_RXPOL_MASK                        equ 0040h
U5CON2_RUNOVF_POSN                       equ 0007h
U5CON2_RUNOVF_POSITION                   equ 0007h
U5CON2_RUNOVF_SIZE                       equ 0001h
U5CON2_RUNOVF_LENGTH                     equ 0001h
U5CON2_RUNOVF_MASK                       equ 0080h
U5CON2_FLO0_POSN                         equ 0000h
U5CON2_FLO0_POSITION                     equ 0000h
U5CON2_FLO0_SIZE                         equ 0001h
U5CON2_FLO0_LENGTH                       equ 0001h
U5CON2_FLO0_MASK                         equ 0001h
U5CON2_FLO1_POSN                         equ 0001h
U5CON2_FLO1_POSITION                     equ 0001h
U5CON2_FLO1_SIZE                         equ 0001h
U5CON2_FLO1_LENGTH                       equ 0001h
U5CON2_FLO1_MASK                         equ 0002h
U5CON2_STP0_POSN                         equ 0004h
U5CON2_STP0_POSITION                     equ 0004h
U5CON2_STP0_SIZE                         equ 0001h
U5CON2_STP0_LENGTH                       equ 0001h
U5CON2_STP0_MASK                         equ 0010h
U5CON2_STP1_POSN                         equ 0005h
U5CON2_STP1_POSITION                     equ 0005h
U5CON2_STP1_SIZE                         equ 0001h
U5CON2_STP1_LENGTH                       equ 0001h
U5CON2_STP1_MASK                         equ 0020h
U5CON2_U5FLO_POSN                        equ 0000h
U5CON2_U5FLO_POSITION                    equ 0000h
U5CON2_U5FLO_SIZE                        equ 0002h
U5CON2_U5FLO_LENGTH                      equ 0002h
U5CON2_U5FLO_MASK                        equ 0003h
U5CON2_U5TXPOL_POSN                      equ 0002h
U5CON2_U5TXPOL_POSITION                  equ 0002h
U5CON2_U5TXPOL_SIZE                      equ 0001h
U5CON2_U5TXPOL_LENGTH                    equ 0001h
U5CON2_U5TXPOL_MASK                      equ 0004h
U5CON2_U5STP_POSN                        equ 0004h
U5CON2_U5STP_POSITION                    equ 0004h
U5CON2_U5STP_SIZE                        equ 0002h
U5CON2_U5STP_LENGTH                      equ 0002h
U5CON2_U5STP_MASK                        equ 0030h
U5CON2_U5RXPOL_POSN                      equ 0006h
U5CON2_U5RXPOL_POSITION                  equ 0006h
U5CON2_U5RXPOL_SIZE                      equ 0001h
U5CON2_U5RXPOL_LENGTH                    equ 0001h
U5CON2_U5RXPOL_MASK                      equ 0040h
U5CON2_U5RUNOVF_POSN                     equ 0007h
U5CON2_U5RUNOVF_POSITION                 equ 0007h
U5CON2_U5RUNOVF_SIZE                     equ 0001h
U5CON2_U5RUNOVF_LENGTH                   equ 0001h
U5CON2_U5RUNOVF_MASK                     equ 0080h
U5CON2_U5FLO0_POSN                       equ 0000h
U5CON2_U5FLO0_POSITION                   equ 0000h
U5CON2_U5FLO0_SIZE                       equ 0001h
U5CON2_U5FLO0_LENGTH                     equ 0001h
U5CON2_U5FLO0_MASK                       equ 0001h
U5CON2_U5FLO1_POSN                       equ 0001h
U5CON2_U5FLO1_POSITION                   equ 0001h
U5CON2_U5FLO1_SIZE                       equ 0001h
U5CON2_U5FLO1_LENGTH                     equ 0001h
U5CON2_U5FLO1_MASK                       equ 0002h
U5CON2_U5STP0_POSN                       equ 0004h
U5CON2_U5STP0_POSITION                   equ 0004h
U5CON2_U5STP0_SIZE                       equ 0001h
U5CON2_U5STP0_LENGTH                     equ 0001h
U5CON2_U5STP0_MASK                       equ 0010h
U5CON2_U5STP1_POSN                       equ 0005h
U5CON2_U5STP1_POSITION                   equ 0005h
U5CON2_U5STP1_SIZE                       equ 0001h
U5CON2_U5STP1_LENGTH                     equ 0001h
U5CON2_U5STP1_MASK                       equ 0020h

